Revit 2024 API
TemporaryGraphicsCommandData.Document Property
 The document.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public Document Document { get; internal set; }
Visual Basic
Public Property Document As Document
	Get
	Friend Set
Visual C++
public:
property Document^ Document {
	Document^ get ();
	internal: void set (Document^ value);
}
See Also
TemporaryGraphicsCommandData Class
Autodesk.Revit.UI Namespace